/* 
    Tag Managment Algorithm
*/

/* 
    Endpoints

    tags/
    tags/tag
    tags/strong
    tags/weak
*/

/* 
    Imports
*/

const math = localStorage.getItem("math") || "[]";
const eng = localStorage.getItem("math") || "[]";
const geo = localStorage.getItem("math") || "[]";

/* 
    Functions
*/

// translates tags

function translate(tag: number) {
  const tags: any = {
    100: "სიმრავლეთა თანაკვეთა",
    101: "სიმრავლეთა გაერთიანება",
    102: "სიმრავლის დამატება",
    103: "ვენის დიაგრამა",
    1000: "სიმრავლეები",
    104: "არითმეტიკა ნატურალურ რიცხვებზე",
    1001: "ნატურალური რიცხვები",
    105: "მარტივ მამრავლებლად დაშლა",
    106: "ნაშთიანი გაყოფა",
    1002: "მარტივი და შედგენილი რიცხვები",
    107: "არითმეტიკა მთელ რიცხვებზე",
    1003: "მთელი რიცხვები",
    1004: "რაციონალური რიცხვები",
    108: "რაციონალური რიცხვების შედარება",
    109: "არითმეტიკა რაციონალურ რიცხვებზე",
    110: "დამრგვალება",
    1005: "ირაციონალური და ნამდვილი რიცხვები",
    111: "არითმეტიკა ირაციონალურ და ნამდვილ რიცხვებზე",
    112: "ირაციონალური და ნამდვილი რიცხვების შედარება",
    1006: "რიცხვითი ღერძი",
    113: "წერტილის კოორდინატი",
    114: "ნამდვილი რიცხვის შესაბამისი წერტილის გამოსახვა რიცხვით ღერძზე",
    1007: "რიცხვითი შუალედები",
    115: "შუალედების გაერთიანება და თანაკვეთა",
    1008: "რიცხვის მოდული",
    1009: "პოზიციური სისტემები",
    116: "ათობითიდან ორობითში გადაყვანა",
    117: "ორობითიდან ათობითში გადაყვანა",
    1010: "პროპორცია",
    118: "პროპორციის უცნობი წევრის პოვნა",
    119: "პირდაპირ პროპორციულობა",
    120: "უკუპროპორციულობა",
    1011: "პროცენტი და ნაწილი",
    121: "პროცენტისა და ნაწილის პოვნა",
    122: "ორი რიცხვის ფარდობის პროცენტულად გამოსახვა",
    1012: "ხარისხები",
    123: "ნამრავლის ფარდობისა და ხარისხის ახარისხება",
    124: "მოქმდებები ტოლფუძიანი ხარისხებზე",
    1013: "ერთწევრი და მრავალწევრი",
    125: "მოქმდებები მრავალწევრებზე",
    1014: "შემოკლებული გამრავლების ფორმულები",
    1015: "მრავალწევრის დაშლა",
    126: "ფრჩხილებს გარეთ გატანა",
    127: "დაჯგუფების ხერხი",
    128: "მამრავლებლად დაშლა შემოკ. გამრლ. ფორმ. გამოყენებით",
    1016: "რაციონალური გამოსახულება",
    1017: "N - ური ხარისხის ფესვი, არითმეტიკული ფესვი",
    1018: "ალგებრული გამოსახულება",
    1019: "ლოგარითმი",
    129: "ლოგარითმული იგივეობა",
    130: "ნამრავლის შეფარდება და ხარისხის ლოგარითმი",
    131: "ლოგარითმში ფუძის შეცვლის ფორმულა",
    1020: "კოორდინატთა სისტემა სიბრტყეზე",
    132: "წერტილის კოორდინატები",
    133: "ორ წერტილს შორის მანძილის გამოთვლა",
    1021: "კოორდინატთა სისტემა სივრცეში",
    134: "წერტილის კოორდინატები სივრცეში",
    1022: "ფუნქცია",
    135: "განსაზღვრის არე",
    136: "მნიშვნელობათა არე",
    137: "ზრდადობა, კლებადობა, კენტობა, ლუწობა, პერიოდულება",
    138: "ფუნქციის უდიდესი და უმცრირესი მნიშვნეობა",
    139: "ფუნქციათა კომპოზიცია პარამეტრის შემცვლელი ფუნქციები",
    140: "ფუნქციის მოცემა ცხრილის, ფორმულისა და გრაფიკიის საშუალებით",
    141: "ფუნქციის მნიშნველობის გამოთვლა არგუენტის მოცემული მნიშვნელობისთვის",
    142: "წრფივი ფუნქციები",
    143: "კვადრატული ფუნქციები",
    144: "ხარისხოვანი ფუნქციები",
    145: "მაჩვენებლიანი ფუნქციები",
    146: "ლოგარითმული ფუნქციები",
    147: "ტრიგონომეტრიული ფუნქციები",
    1023: "კუთხის გრადუსული და რადიანული ზომა",
    1024: "ტრიგონომეტრიული ფუქნციები",
    148: "სინუსი, კოსინუსი და ტანგესი",
    149: "ნიშნების მეოთხედების მიხედვით",
    150: "პერიოდულბა",
    151: "ლუწობა და კენტობა",
    152: "დაყვანის ფორმულები",
    153: "ძირითადი დამოკიდებულებები ერთი და იმავე არგუმენტის ტრიგონომეტრიულ ფუნქციებს შორის",
    1025: "განტოლებები",
    1026: "ერთუცნობიანი წრფივი განტოლება",
    1027: "ერთუცნობიანი კვადრატული განტოლება",
    154: "დისკრიმინანტი",
    155: "კვადრატული განტოლების ამოხსნა",
    156: "ვიეტის თეორემა",
    1028: "კვადრატული სამწევრი",
    157: "კვადრატული სამწევრის ფესვები",
    158: "კვადრატული სამწევრის დაშლა წრფივ მამრავლებლად",
    1029: "ორუცნობიანი განტოლებათა სისტემა",
    1030: "უტოლობა, უტოლობათა სისტემა",
    1031: "ირაციონალური განტოლება",
    1032: "მაჩვენებლიანი განტოლება და უტოლობა",
    1033: "ლოგარითმული განტოლება და უტოლობა",
    1034: "ტრიგონომეტრიული განტოლება",
    1035: "რიცხვითი მიმდევრობა",
    1036: "არითმეტიკული პროგრესია",
    1037: "გეომეტრიული პროგრესია",
    1038: "კომბინატორიკის ელემენტები",
  };
  const categorized: any = {
    1000: [100, 101, 102, 103],
    1001: [104],
    1002: [105, 106],
    1003: [107],
    1004: [108, 109, 110],
    1005: [111, 112],
    1006: [113, 114],
    1007: [115],
    1008: [],
    1009: [116, 117],
    1010: [118, 119, 120],
    1011: [121, 122],
    1012: [123, 124],
    1013: [125],
    1014: [],
    1015: [126, 127, 128],
    1016: [],
    1017: [],
    1018: [],
    1019: [129, 130, 131],
    1020: [132, 133],
    1021: [134],
    1022: [135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147],
    1023: [],
    1024: [148, 149, 150, 151, 152, 153],
    1025: [],
    1026: [],
    1027: [154, 155, 156],
    1028: [157, 158],
    1029: [],
    1030: [],
    1031: [],
    1032: [],
    1033: [],
    1034: [],
    1035: [],
    1036: [],
    1037: [],
    1038: [],
  };

  return {
    id: tag,
    tag: tags[tag],
    children: tag.toString().length == 4 ? categorized[tag] : [],
  };
}

// returns tags, tags/strong and tags/weak

function getTags() {
  const strong: string[] = [];
  const weak: string[] = [];
  const points: { tag: string; points: number }[] = [];
  JSON.parse(math).strong.map((tag: any) => {
    strong.push(translate(tag).tag);
  });
  JSON.parse(math).weak.map((tag: any) => {
    weak.push(translate(tag).tag);
  });
  JSON.parse(math).points.map((tag: any) => {
    points.push({
      tag: translate(tag.tag).tag,
      points: tag.points,
    });
  });

  return {
    strong: strong,
    weak: weak,
    points: points,
  };
}

/* 
    Algorithms
*/
