/* 
    Tag Managment Algorithm
*/

/* 
    Endpoints

    tags/
    tags/tag
    tags/strong
    tags/weak

*/

/* 
    Imports
*/

const math = localStorage.getItem("math") || "[]";
const eng = localStorage.getItem("math") || "[]";
const geo = localStorage.getItem("math") || "[]";

/* 
    Functions
*/

// translates tags

function translate(){
    const tags = {
      100: "სიმრავლეთა თანაკვეთა",
      101: "სიმრავლეთა გაერთიანება",
      102: "სიმრავლის დამატება",
      103: "ვენის დიაგრამა",
      1000: "სიმრავლეები",
      200: "არითმეტიკა ნატურალურ რიცხვებზე",
      2000: "ნატურალური რიცხვები",
      300: "მარტივ მამრავლებლად დაშლა",
      301: "ნაშთიანი გაყოფა",
      3000: "მარტივი და შედგენილი რიცხვები",
      400: "არითმეტიკა მთელ რიცხვებზე",
      4000: "მთელი რიცხვები",
      5000: "რაციონალური რიცხვები",
      500: "რაციონალური რიცხვების შედარება",
      501: "არითმეტიკა რაციონალურ რიცხვებზე",
      502: "დამრგვალება",
      6000: "ირაციონალური და ნამდვილი რიცხვები",
      600: "არითმეტიკა ირაციონალურ და ნამდვილ რიცხვებზე",
      601: "ირაციონალური და ნამდვილი რიცხვების შედარება",
      7000: "რიცხვითი ღერძი",
      8000: "რიცხვითი შუალედები",
      9000: "რიცხვის მოდული",
      10000: "პოზიციური სისტემები",
      11000: "პროპორცია",
      22000: "პროცენტი და ნაწილი",
      23000: "ხარისხები",
      24000: "ერთწევრი და მრავალწევრი",
      25000: "შემოკლებული გამრავლების ფორმულები",
      26000: "მრავალწევრის დაშლა",
      27000: "რაციონალური გამოსახულება",
      28000: "N - ური ხარისხის ფესვი, არითმეტიკული ფესვი",
      29000: "ალგებრული გამოსახულება",
      30000: "ლოგარითმი",
      31000: "კოორდინატთა სისტემა სიბრტყეზე",
      32000: "კოორდინატთა სისტემა სივრცეში",
      33000: "ფუნქცია",
      34000: "კუთხის გრადუსული და რადიანული ზომა",
      35000: "ტრიგონომეტრიული ფუქნციები",
      36000: "განტოლებები",
      37000: "ერთუცნობიანი წრფივი განტოლება",
      38000: "ერთუცნობიანი კვადრატული განტოლება",
      39000: "კვადრატული სამწევრი",
      40000: "ორუცნობიანი განტოლებათა სისტემა",
      41000: "უტოლობა, უტოლობათა სისტემა",
      42000: "ირაციონალური განტოლება",
      43000: "მაჩვენებლიანი განტოლება და უტოლობა",
      44000: "ლოგარითმული განტოლება და უტოლობა",
      45000: "ტრიგონომეტრიული განტოლება",
      46000: "რიცხვითი მიმდევრობა",
      47000: "არითმეტიკული პროგრესია",
      48000: "გეომეტრიული პროგრესია",
      49000: "კომბინატორიკის ელემენტები",
    };
}

// returns tags

function getTags(){
    JSON.parse(math).strong.map((tag: any) => {

    })
    JSON.parse(math).weak
    JSON.parse(math).points;

}

/* 
    Algorithms
*/
